## staging: manifest_secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 76 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                               NAME                                               |
|--------|--------------------------------------------------------------------------------------------------|
| add    | `aws_secretsmanager_secret.manifest_admin_client_secret`                                         |
|        | `aws_secretsmanager_secret.manifest_auth_tokens`                                                 |
|        | `aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id`                                |
|        | `aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id`                                     |
|        | `aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids`                                |
|        | `aws_secretsmanager_secret.manifest_aws_route53_zone`                                            |
|        | `aws_secretsmanager_secret.manifest_aws_ses_access_key`                                          |
|        | `aws_secretsmanager_secret.manifest_aws_ses_secret_key`                                          |
|        | `aws_secretsmanager_secret.manifest_cache_clear_client_secret`                                   |
|        | `aws_secretsmanager_secret.manifest_crm_github_personal_access_token`                            |
|        | `aws_secretsmanager_secret.manifest_dangerous_salt`                                              |
|        | `aws_secretsmanager_secret.manifest_debug_key`                                                   |
|        | `aws_secretsmanager_secret.manifest_document_download_api_key`                                   |
|        | `aws_secretsmanager_secret.manifest_fresh_desk_api_key`                                          |
|        | `aws_secretsmanager_secret.manifest_fresh_desk_product_id`                                       |
|        | `aws_secretsmanager_secret.manifest_gc_articles_api_auth_password`                               |
|        | `aws_secretsmanager_secret.manifest_gc_articles_api_auth_username`                               |
|        | `aws_secretsmanager_secret.manifest_mixpanel_project_token`                                      |
|        | `aws_secretsmanager_secret.manifest_new_relic_license_key`                                       |
|        | `aws_secretsmanager_secret.manifest_postgres_host`                                               |
|        | `aws_secretsmanager_secret.manifest_redis_publish_url`                                           |
|        | `aws_secretsmanager_secret.manifest_redis_url`                                                   |
|        | `aws_secretsmanager_secret.manifest_salesforce_client_privatekey`                                |
|        | `aws_secretsmanager_secret.manifest_salesforce_engagement_product_id`                            |
|        | `aws_secretsmanager_secret.manifest_salesforce_engagement_record_type`                           |
|        | `aws_secretsmanager_secret.manifest_salesforce_engagement_standard_pricebook_id`                 |
|        | `aws_secretsmanager_secret.manifest_salesforce_generic_account_id`                               |
|        | `aws_secretsmanager_secret.manifest_salesforce_password`                                         |
|        | `aws_secretsmanager_secret.manifest_salesforce_security_token`                                   |
|        | `aws_secretsmanager_secret.manifest_salesforce_username`                                         |
|        | `aws_secretsmanager_secret.manifest_secret_key`                                                  |
|        | `aws_secretsmanager_secret.manifest_sendgrid_api_key`                                            |
|        | `aws_secretsmanager_secret.manifest_sqlalachemy_database_reader_uri`                             |
|        | `aws_secretsmanager_secret.manifest_sqlalachemy_database_uri`                                    |
|        | `aws_secretsmanager_secret.manifest_sre_client_secret`                                           |
|        | `aws_secretsmanager_secret.manifest_waf_secret`                                                  |
|        | `aws_secretsmanager_secret.manifest_zendesk_api_key`                                             |
|        | `aws_secretsmanager_secret.manifest_zendesk_sell_api_key`                                        |
|        | `aws_secretsmanager_secret_version.manifest_admin_client_secret_version`                         |
|        | `aws_secretsmanager_secret_version.manifest_auth_tokens_version`                                 |
|        | `aws_secretsmanager_secret_version.manifest_aws_pinpoint_default_pool_id_version`                |
|        | `aws_secretsmanager_secret_version.manifest_aws_pinpoint_sc_pool_id_version`                     |
|        | `aws_secretsmanager_secret_version.manifest_aws_pinpoint_sc_template_ids_version`                |
|        | `aws_secretsmanager_secret_version.manifest_aws_route53_zone_version`                            |
|        | `aws_secretsmanager_secret_version.manifest_aws_ses_access_key_version`                          |
|        | `aws_secretsmanager_secret_version.manifest_aws_ses_secret_key_version`                          |
|        | `aws_secretsmanager_secret_version.manifest_cache_clear_client_secret_version`                   |
|        | `aws_secretsmanager_secret_version.manifest_crm_github_personal_access_token_version`            |
|        | `aws_secretsmanager_secret_version.manifest_dangerous_salt_version`                              |
|        | `aws_secretsmanager_secret_version.manifest_debug_key_version`                                   |
|        | `aws_secretsmanager_secret_version.manifest_document_download_api_key_version`                   |
|        | `aws_secretsmanager_secret_version.manifest_fresh_desk_api_key_version`                          |
|        | `aws_secretsmanager_secret_version.manifest_fresh_desk_product_id_version`                       |
|        | `aws_secretsmanager_secret_version.manifest_gc_articles_api_auth_password_version`               |
|        | `aws_secretsmanager_secret_version.manifest_gc_articles_api_auth_username_version`               |
|        | `aws_secretsmanager_secret_version.manifest_mixpanel_project_token_version`                      |
|        | `aws_secretsmanager_secret_version.manifest_new_relic_license_key_version`                       |
|        | `aws_secretsmanager_secret_version.manifest_postgres_host_version`                               |
|        | `aws_secretsmanager_secret_version.manifest_redis_publish_url`                                   |
|        | `aws_secretsmanager_secret_version.manifest_redis_url`                                           |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_client_privatekey_version`                |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_engagement_product_id_version`            |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_engagement_record_type_version`           |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_engagement_standard_pricebook_id_version` |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_generic_account_id_version`               |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_password_version`                         |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_security_token_version`                   |
|        | `aws_secretsmanager_secret_version.manifest_salesforce_username_version`                         |
|        | `aws_secretsmanager_secret_version.manifest_secret_key_version`                                  |
|        | `aws_secretsmanager_secret_version.manifest_sendgrid_api_key_version`                            |
|        | `aws_secretsmanager_secret_version.manifest_sqlalachemy_database_reader_uri`                     |
|        | `aws_secretsmanager_secret_version.manifest_sqlalachemy_database_uri`                            |
|        | `aws_secretsmanager_secret_version.manifest_sre_client_secret_version`                           |
|        | `aws_secretsmanager_secret_version.manifest_waf_secret_version`                                  |
|        | `aws_secretsmanager_secret_version.manifest_zendesk_api_key_version`                             |
|        | `aws_secretsmanager_secret_version.manifest_zendesk_sell_api_key_version`                        |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/11390738308).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.manifest_admin_client_secret will be created
  + resource "aws_secretsmanager_secret" "manifest_admin_client_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_ADMIN_CLIENT_SECRET"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_auth_tokens will be created
  + resource "aws_secretsmanager_secret" "manifest_auth_tokens" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_AUTH_TOKENS"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id will be created
  + resource "aws_secretsmanager_secret" "manifest_aws_pinpoint_default_pool_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_AWS_PINPOINT_DEFAULT_POOL_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id will be created
  + resource "aws_secretsmanager_secret" "manifest_aws_pinpoint_sc_pool_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_AWS_PINPOINT_SC_POOL_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids will be created
  + resource "aws_secretsmanager_secret" "manifest_aws_pinpoint_sc_template_ids" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_AWS_PINPOINT_SC_TEMPLATE_IDS"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_aws_route53_zone will be created
  + resource "aws_secretsmanager_secret" "manifest_aws_route53_zone" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_AWS_ROUTE53_ZONE"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_aws_ses_access_key will be created
  + resource "aws_secretsmanager_secret" "manifest_aws_ses_access_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_AWS_SES_ACCESS_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_aws_ses_secret_key will be created
  + resource "aws_secretsmanager_secret" "manifest_aws_ses_secret_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_AWS_SES_SECRET_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_cache_clear_client_secret will be created
  + resource "aws_secretsmanager_secret" "manifest_cache_clear_client_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_CACHE_CLEAR_CLIENT_SECRET"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_crm_github_personal_access_token will be created
  + resource "aws_secretsmanager_secret" "manifest_crm_github_personal_access_token" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_CRM_GITHUB_PERSONAL_ACCESS_TOKEN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_dangerous_salt will be created
  + resource "aws_secretsmanager_secret" "manifest_dangerous_salt" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_DANGEROUS_SALT"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_debug_key will be created
  + resource "aws_secretsmanager_secret" "manifest_debug_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_DEBUG_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_document_download_api_key will be created
  + resource "aws_secretsmanager_secret" "manifest_document_download_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_DOCUMENT_DOWNLOAD_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_fresh_desk_api_key will be created
  + resource "aws_secretsmanager_secret" "manifest_fresh_desk_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_FRESH_DESK_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_fresh_desk_product_id will be created
  + resource "aws_secretsmanager_secret" "manifest_fresh_desk_product_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_FRESH_DESK_PRODUCT_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_gc_articles_api_auth_password will be created
  + resource "aws_secretsmanager_secret" "manifest_gc_articles_api_auth_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_GC_ARTICLES_API_AUTH_PASSWORD"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_gc_articles_api_auth_username will be created
  + resource "aws_secretsmanager_secret" "manifest_gc_articles_api_auth_username" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_GC_ARTICLES_API_AUTH_USERNAME"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_mixpanel_project_token will be created
  + resource "aws_secretsmanager_secret" "manifest_mixpanel_project_token" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_MIXPANEL_PROJECT_TOKEN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_new_relic_license_key will be created
  + resource "aws_secretsmanager_secret" "manifest_new_relic_license_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_NEW_RELIC_LICENSE_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_postgres_host will be created
  + resource "aws_secretsmanager_secret" "manifest_postgres_host" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_POSTGRES_HOST"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_redis_publish_url will be created
  + resource "aws_secretsmanager_secret" "manifest_redis_publish_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_REDIS_PUBLISH_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_redis_url will be created
  + resource "aws_secretsmanager_secret" "manifest_redis_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_REDIS_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_client_privatekey will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_client_privatekey" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_CLIENT_PRIVATEKEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_engagement_product_id will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_engagement_product_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_ENGAGEMENT_PRODUCT_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_engagement_record_type will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_engagement_record_type" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_ENGAGEMENT_RECORD_TYPE"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_engagement_standard_pricebook_id will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_engagement_standard_pricebook_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_ENGAGEMENT_STANDARD_PRICEBOOK_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_generic_account_id will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_generic_account_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_GENERIC_ACCOUNT_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_password will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_PASSWORD"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_security_token will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_security_token" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_SECURITY_TOKEN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_salesforce_username will be created
  + resource "aws_secretsmanager_secret" "manifest_salesforce_username" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SALESFORCE_USERNAME"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_secret_key will be created
  + resource "aws_secretsmanager_secret" "manifest_secret_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SECRET_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_sendgrid_api_key will be created
  + resource "aws_secretsmanager_secret" "manifest_sendgrid_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SENDGRID_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_sqlalachemy_database_reader_uri will be created
  + resource "aws_secretsmanager_secret" "manifest_sqlalachemy_database_reader_uri" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "SQLALCHEMY_DATABASE_READER_URI"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_sqlalachemy_database_uri will be created
  + resource "aws_secretsmanager_secret" "manifest_sqlalachemy_database_uri" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "SQLALCHEMY_DATABASE_URI"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_sre_client_secret will be created
  + resource "aws_secretsmanager_secret" "manifest_sre_client_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_SRE_CLIENT_SECRET"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_waf_secret will be created
  + resource "aws_secretsmanager_secret" "manifest_waf_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_WAF_SECRET"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_zendesk_api_key will be created
  + resource "aws_secretsmanager_secret" "manifest_zendesk_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_ZENDESK_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_zendesk_sell_api_key will be created
  + resource "aws_secretsmanager_secret" "manifest_zendesk_sell_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_ZENDESK_SELL_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_admin_client_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_admin_client_secret_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_auth_tokens_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_auth_tokens_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_aws_pinpoint_default_pool_id_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_aws_pinpoint_default_pool_id_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_aws_pinpoint_sc_pool_id_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_aws_pinpoint_sc_pool_id_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_aws_pinpoint_sc_template_ids_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_aws_pinpoint_sc_template_ids_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_aws_route53_zone_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_aws_route53_zone_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_aws_ses_access_key_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_aws_ses_access_key_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_aws_ses_secret_key_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_aws_ses_secret_key_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_cache_clear_client_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_cache_clear_client_secret_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_crm_github_personal_access_token_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_crm_github_personal_access_token_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_admin_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_auth_tokens"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_route53_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_clear_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_crm_github_personal_access_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_dangerous_salt"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_debug_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_document_download_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_fresh_desk_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_fresh_desk_product_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_gc_articles_api_auth_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_gc_articles_api_auth_username"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_mixpanel_project_token"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
